artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 20
scenarios:
  - flow:
      - post:
          url: "/users"
          json:
            schoolId: "" 
            firstName: "Test"
            lastName: "user"
            email: "{{ $randomString() }}"
            password: "Password123"
            role: "admin"